{
  "projects": [
    {
      "id": 1,
      "slug": "evarastaffing",
      "title": "EvaraStaffing",
      "category": "Consultancy",
      "meta": "WordPress • Elementor",
      "tools": ["WordPress", "Elementor", "JavaScript"],
      "shortDescription": "Consultancy website with resume upload functionality for staffing solutions.",
      "duration": "3 weeks",
      "role": "Full-stack Developer",
      "team": "Solo project",
      "liveUrl": "#",
      "heroImage": "Banner/Evarastaffing.png",
      "gallery": ["Banner/Evarastaffing.png"],
      "keyFeatures": [
        "Resume upload and management",
        "Service showcase",
        "Clean and professional UI",
        "Mobile responsive design"
      ],
      "caseStudy": {
        "overview": "EvaraStaffing wanted a professional site where job seekers could upload resumes while presenting their services in a credible way.",
        "challenge": "Their old setup lacked branding, clear structure, and a system to handle candidate submissions.",
        "research": "Looked at staffing competitors to identify features like resume uploads, clear CTAs, and trust-building layouts.",
        "approach": "Chose WordPress with Elementor for quick customization and scalability, keeping future updates simple.",
        "implementation": "Designed a clean interface, built a resume upload form, and structured service pages for easy browsing.",
        "solution": "Delivered a consultancy platform with direct resume submissions, polished visuals, and service clarity.",
        "results": "Saw a 45% increase in candidate submissions and more client inquiries within weeks.",
        "impact": "Helped EvaraStaffing scale digitally and simplify their recruitment flow.",
        "lessons": "Straightforward navigation and visible CTAs significantly improve conversions."
      },
      "testimonial": {
        "quote": "The resume upload feature has been a game-changer for our hiring process.",
        "author": "Client",
        "position": "Founder, EvaraStaffing"
      }
    },
    {
      "id": 2,
      "slug": "tourly",
      "title": "Tourly",
      "category": "Small Business",
      "meta": "React • GSAP • Vercel",
      "tools": ["React", "GSAP", "Vercel"],
      "shortDescription": "Modern travel packages and booking platform for tours and trips.",
      "duration": "6 weeks",
      "role": "Frontend Developer",
      "team": "2 developers, 1 designer",
      "liveUrl": "#",
      "heroImage": "Banner/tourly.png",
      "gallery": ["Banner/tourly.png"],
      "keyFeatures": [
        "Tour package showcase",
        "Online booking system",
        "Animated UI with GSAP",
        "Mobile responsive"
      ],
      "caseStudy": {
        "overview": "Tourly needed a modern platform that made browsing and booking trips easy and enjoyable.",
        "challenge": "The old site felt static, outdated, and didn’t offer smooth booking flows.",
        "research": "Studied leading travel portals to figure out what makes browsing intuitive and fun.",
        "approach": "Built with React and GSAP to deliver fast performance and engaging animations.",
        "implementation": "Developed dynamic package pages, smooth transitions, and a responsive booking form.",
        "solution": "Created a lively, mobile-first travel site that highlights packages and streamlines booking.",
        "results": "Inquiries for tours grew steadily, and customers reported a smoother experience.",
        "impact": "Tourly could compete with larger platforms and stand out with better usability.",
        "lessons": "Adding motion and interactivity makes users spend more time exploring."
      },
      "testimonial": {
        "quote": "Customers love how easy it is to browse and book trips now.",
        "author": "Owner",
        "position": "Tourly Founder"
      }
    },
    {
      "id": 3,
      "slug": "rv-internet",
      "title": "RV Internet",
      "category": "Tech",
      "meta": "JavaScript • Tailwind • Node.js",
      "tools": ["JavaScript", "Tailwind CSS", "Node.js"],
      "shortDescription": "Tech website showcasing routers, modems, and internet solutions.",
      "duration": "5 weeks",
      "role": "Frontend Lead",
      "team": "2 developers",
      "liveUrl": "#",
      "heroImage": "Banner/RV.png",
      "gallery": ["Banner/RV.png"],
      "keyFeatures": [
        "Product showcase",
        "Modern tech design",
        "5-page responsive layout",
        "Trust-building structure"
      ],
      "caseStudy": {
        "overview": "RV Internet wanted a modern site to showcase routers and connectivity solutions clearly.",
        "challenge": "Their existing site was outdated, cluttered, and didn’t highlight products properly.",
        "research": "Analyzed competitor ISP websites to see how they structured product categories.",
        "approach": "Used JavaScript with Tailwind to design a sleek, responsive layout.",
        "implementation": "Organized products into categories, added visuals, and built trust-focused sections.",
        "solution": "Delivered a clean, modern internet solutions site with focus on usability.",
        "results": "Website inquiries increased, and customers found products easier to navigate.",
        "impact": "Improved brand credibility and positioned RV Internet as more professional.",
        "lessons": "A structured product layout improves trust and helps customers make decisions faster."
      },
      "testimonial": {
        "quote": "Our website finally reflects the trust and quality of our services.",
        "author": "CEO",
        "position": "RV Internet"
      }
    },
    {
      "id": 4,
      "slug": "himachal-travel",
      "title": "Himachal Travel",
      "category": "Travel",
      "meta": "Figma • React • GSAP",
      "tools": ["Figma", "React", "GSAP"],
      "shortDescription": "Travel guide with immersive motion design showcasing Himachal destinations.",
      "duration": "4 weeks",
      "role": "Designer & Developer",
      "team": "Solo",
      "liveUrl": "#",
      "heroImage": "Banner/Himachal.png",
      "gallery": ["Banner/Himachal.png"],
      "keyFeatures": [
        "Immersive animations",
        "Destination highlights",
        "Smooth motion UI",
        "Responsive design"
      ],
      "caseStudy": {
        "overview": "Himachal Travel wanted a travel guide that feels alive and inspiring.",
        "challenge": "Their old site looked flat and failed to capture the excitement of travel.",
        "research": "Checked top storytelling-based travel sites to learn how they engage users.",
        "approach": "Designed in Figma, then built with React and GSAP for interactive storytelling.",
        "implementation": "Created destination highlights with smooth animations and visual flow.",
        "solution": "Developed a motion-driven site that feels immersive and easy to explore.",
        "results": "User engagement rose, with more inquiries about travel packages.",
        "impact": "Made the platform stand out with its unique motion-based approach.",
        "lessons": "Motion and storytelling together create stronger emotional impact."
      },
      "testimonial": {
        "quote": "The animations make our travel showcase stand out beautifully.",
        "author": "Client",
        "position": "Founder, Himachal Travel"
      }
    },
    {
      "id": 5,
      "slug": "dr-noor-oil",
      "title": "Dr Noor Oil",
      "category": "E-commerce",
      "meta": "TypeScript • Next.js • Vercel",
      "tools": ["TypeScript", "Next.js", "Vercel"],
      "shortDescription": "E-commerce store for health oil products with cart and payment integration.",
      "duration": "7 weeks",
      "role": "Senior Developer",
      "team": "3 developers, 1 designer",
      "liveUrl": "#",
      "heroImage": "Banner/drnooroil.png",
      "gallery": ["Banner/drnooroil.png"],
      "keyFeatures": [
        "Product showcase",
        "Shopping cart",
        "Payment gateway",
        "Responsive store design"
      ],
      "caseStudy": {
        "overview": "Dr Noor Oil wanted to expand sales online with a smooth shopping experience.",
        "challenge": "They had no online presence and were missing out on digital customers.",
        "research": "Looked at successful health & wellness e-commerce stores for UX patterns.",
        "approach": "Chose Next.js with TypeScript for speed and reliability, hosted on Vercel.",
        "implementation": "Built product pages, added cart + checkout, and polished the UI.",
        "solution": "Delivered a professional e-commerce site ready for growth.",
        "results": "Online sales grew by 60% in just three months.",
        "impact": "Transformed their local business into a nationwide brand.",
        "lessons": "A seamless checkout process is critical to boosting e-commerce sales."
      },
      "testimonial": {
        "quote": "The new website has doubled our sales — seamless and professional.",
        "author": "Dr Noor",
        "position": "Founder"
      }
    }
  ]
}
